'use client';

import Tabs from '../Tabs';
/* 
Кількість осіб: 4
Зовнішній тент:	40D/240Т Nylon Double Rip Stop 6000 мм SILICONE
Внутрішній намет: 210T Polyester Rip Stop
Підлога:	190T Nylon 10000 мм
Кількість входів:	2
Каркас:	Alu (алюміній), Ø 8.5/9.5мм 
Кількість дуг: 4
Вага (без кілочків і упаковки), кг: 5,09 
Вага (повний комплект), кг: 5,57
Розмір упаковки, см:	∅20 × 45
Кольори: зелений, помаранчевий
Гарантія: 12 місяців
 */
const desc =
  'Всесезонний чотиримісний намет. Стійка конструкція з чотирьох зовнішніх дуг ідеально підходить для екстремальних походів. Великі і зручні тамбури, в яких можна розмістити речі і спорядження. Два входи дають можливість прямого доступу в спальню і забезпечують ідеальну вентиляцію. Регулювання вентиляції внутрішнього намету за допомогою блискавки і захисна спідниця дозволяють використовувати намет протягом всього року. Намет може використовуватися без спального приміщення як їдальня, склад і т.д. Складана захисна "спідниця" перешкоджає можливому попаданню пилу, снігу.';
const attr = [
  ["Кількість осіб", '4'],
  ['Зовнішній тент', '40D/240Т Nylon Double Rip Stop 6000 мм SILICONE'],
  ['Внутрішній намет', '210T Polyester Rip Stop'],
  ["Підлога", '190T Nylon 10000 мм'],
  ['Кількість входів', '2'],
  ["Каркас", 'Alu (алюміній), Ø 8.5/9.5мм'],
];
const rev = [];

const Footer = () => {
  return (
    <>
      <h2>Footer</h2>
      <Tabs description={desc} attributes={attr} reviews={rev} />
    </>
  );
};

export default Footer;
